station_code_dicts = {
    '东港', '老虎滩', '营口', '鲅鱼圈', '葫芦岛', '芷锚湾', '秦皇岛', '曹妃甸', '塘沽', '歧口', '黄骅',
    '滨州港', '东营港', '孤东', '羊角沟', '潍坊', '龙口', '蓬莱', '芝罘岛', '成山头', '石岛', '乳山口',
    '五码头', '小麦岛', '日照', '连云港', '燕尾', '滨海', '外磕角', '吕泗', '堡镇', '吴淞', '高桥',
    '芦潮港', '大戢山', '金山嘴', '滩浒岛', '乍浦', '澉浦', '岱山', '定海', '镇海', '沈家门', '石浦',
    '健跳', '海门Z', '坎门', '温州S', '瑞安S', '鳌江S', '沙埕', '三沙', '北茭', '琯头', '梅花',
    '平潭', '崇武', '厦门', '东山', '云澳', '汕头S', '汕头H', '海门G', '汕尾', '南沙', '遮浪',
    '盐田', '赤湾', '珠海', '灯笼山', '三灶', '涠洲', '北津', '防城港', '石头埠', '闸坡', '白龙尾',
    '北海', '水东', '湛江S', '硇洲', '南渡', '海安', '秀英', '清澜', '东方', '港北', '乌场', '三亚',
    '惠州', '黄埔', '雷州'
}
